// Variables

let btn = document.querySelector('#new-quote');
let quote = document.querySelector('.quote');
let person = document.querySelector('.person');

const quotes = [{
quote : ` "  إذا دعوت الله فلا تستعجل ، و بالغ في الدعاء ، فإذا كنت راضياً بقدر الله منتظراً لفرجه فسيأتيك نصر الله لا محالة .. إذا كنت قانطاً مستعجلاً فأنت لم تنجح في اختبارك و صبرك .. و اعلم أنه يبتـليك بالتأخير لتـحارب وسوسة إبليس ." ` 

 , person : ` ابن القيم `

}, {
quote : ` "   هناك من يتذمر لان للورد شوكاً ، و هناك من يتفاءل لان فوق الشوك وردة ." ` 

  , person : ` جبران خليل جبران `

} , {
quote : ` "  المتواكل .. هو الشخص الذي يتغنى بان الصبر (مفـتاح) الفرج و لا يكلف نفسه عناء البحث عن (الباب) الذي سيستخدم فيه هذا المفتاح لفتحه . " ` 

  , person : `  ابن تيمية  `

} , {
quote : ` "   القدرة على حفظ الاتزان في الطوارئ و وسط الاضطرابات و تجنب الذعر هي العلامات الحقيقية للقيادة . " `

  , person : `  نابليون بونابرت  `

} , {
quote : ` "  كيف ابتسم و بيت المقدس أسير ؟ . " `

 , person : ` صلاح الدين الأيوبي  `

} , {
quote : ` "   أن تكون على حق ، لا يستوجب أن يكون صوتك مرتفعا . " `

  , person : ` مثل ياباني `

} , {
quote : ` "  إن الأحمق يعيش ليأكل ، و إن العاقل يأكل ليعيش .. و إن المؤمن يعيش ليعبد الله . " ` 

  , person : ` الشافعي `

} , {
quote : ` "   يجب ان تعمل في صمت 
 و لا يجب ان يكون الصمت عملك . " `

 , person : `  ليوناردو دافنشي  `

} , { quote : ` "   تعلم حسنَ الاستماعِ كما تتعلمُ حسنَ الكلامِ ، ومن حسنِ الاستماع إمهالُ المتكلمِ حتى ينقضي حديثهُ ، وقلة التلفت إلى الجوابِ ، والإقبالُ بالوجهِ والنظر إلى المتكلمِ
      والوعي لما يقولُ . " `
  , person : `  عبد الله بن المقفع  `

} , {
quote : ` "  قرأت في تسعين موضعا من القرآن أن الله قدر الأرزاق و ضمنها لخلقه ، و قرأت في موضع واحد : الشيطان يعدكم الفقر  فشككنا في قـول الصادق في تسعين موضعاً و صدقنا قول الكاذب في موضع واحد . " `

  , person : `  الحسن البصري  `

}];

btn.addEventListener('click', function(){

let random = Math.floor(Math.random() * quotes.length);

quote.innerText = quotes[random].quote ;
person.innerText = quotes[random].person;

 

});